#Сумма геометрической прогрессии
#Ввод данных
b = int(input("Введите B: ")) # Ввод текста, превращение его в целоое число и присвоение это значение переменной b
q = int(input("Введите Q: ")) # Ввод текста, превращение его в целоое число и присвоение это значение переменной q
n = int(input("Введите N: ")) # Ввод текста, превращение его в целоое число и присвоение это значение переменной n
#Вычисления
if q == 1: # Если для q присвоенно значение 1 то тогда сумма будет равна s=b*n( что написано в некст строке)
    s = b * n
else: # Если же q не 1 то считаем результат суммы по формуле геом прогрессии (в некст строчке)
    s = b * (q**n - 1) // (q - 1)
print("Сумма геометрической прогрессии:", s) #Вывод результат
