С=0 # Вводим переменную и присваиваем ей стартовое значение 0
n = int(input("Введите число: ")) # человек вводит текст а прога превращает его в целое число и присваивает это число переменной n
if 1<=n<=100000: # Задается диапозон значений n
    while n > 0: # цикл который будет выполняться пока n>0
        n = n // 3 # число делится на 3 и остаток отбрасывается. Результат записывается в n
        С += 1 # Увеличиваем переменную на 1
    print("Количество операций =", С) # когда число n уменьшилось до 0 то цикл прекращается и на экран выводится результат
else: # если же n не входит в диапозон 
    print("Ошибка решения") # то выводиться это сообщение и компьютер отказывается выполнять вычесления для неподходящего числа
