# Простое или непростое
n = int(input("Введите число: ")) # Ввод текста, превращение его в целоое число и присвоение это значение переменной n
if 1<=n<=25: # Ввод условия что n должно быть из диапозона 1<=n<=25
    if n < 2: # Проверка на 1
        print("N") # Если n=1 то программа выведет N
    else: # если введено число больше 1 смотрит дальнейшие условия
        for d in range(2, n-1): # Запускается цикл, который будет по очереди перебирать числа в переменную d. Он начнется с 2 и закончится на числе n-2 (так как правая граница в range не включается).
            r = n % d # делит n на число d из цикла и записывает остаток в r
            if r == 0: # если остаток равен 0 то n делится нацело на d
                print("N") # если поделилось без остатка то выводит N
                break # прекращение числа
        else: # если же число не поделилось нацело 
            print("Y") # то выводим Y
else: # относится к диапозону в 2 строчке.
    print("Ошибка переменной") # если n не входит в диапозон тогда выводит print